Repository: kamalsirsa/vtp
Catalog: i18n/*/Enviro.po
Languages: af

source: Startup
af: Opstelling

source: No terrains found (datapath/Terrains/*.xml)
af: Geen terrein data (datapad/Terrains/*.xml)

source: Please choose a terrain
af: Kies 'n terrein

source: Select Terrain
af: Kies Terrein

source: Terrain Creation Parameters
af: Terrein skeppings parameters

source: Couldn't load from that file.
af: Daar was 'n fout met die leer.

source: Upgrading the .ini to a .xml file.
af: Die .ini leer word na .xml omskep.

source: Deleting old file:
af: Ou leer word uitgevee:

source: Couldn't save to file %hs.
af: Die leer %hs kon nie gestoor word nie.

source: Please make sure the file is not read-only.
af: Maak asseblief seker die leer is nie lees-alleen nie.

source: Scene Graph
af: Scene grafiek

source: Plants
af: Plante

source: Linear Structures
af: Linere Strukture

source: Routes
af: Roetes

source: Camera-View
af: Kamera-Uitsig

source: Locations
af: Plekke

source: Building Properties
af: Gebou eienskappe

source: Layers
af: Vlakke

source: Instances
af: Instansies

source: Distance
af: Afstand

source: Time
af: Tyd

source: E&xit (Esc)
af: Gaan &Uit (Esc)

source: Exit
af: Gaan uit

source: &File
af: &Leer

source: Select
af: Selekteer

source: Fences
af: Heinings

source: Navigate
af: Navigeer

source: &Tools
af: &Gereedskap

source: Go to Space
af: Gaan na die ruimte

source: Save scene graph to .osg
af: Stoor .osg leer

source: Time... Ctrl+I
af: Tyd... Ctrl+I

source: Time Stop
af: Tyd Stop

source: Time Faster
af: Tyd Vinniger

source: Wireframe Ctrl+W
af: Draadraam Ctrl+W

source: Fullscreen Ctrl+F
af: Volskerm Ctrl+F

source: Top-Down Camera Ctrl+T
af: Regaf kamera Ctrl+T

source: Framerate Chart Ctrl+Z
af: Raamtempo Grafiek Ctrl+Z

source: Camera - View Settings Ctrl+S
af: Kamera - Verstellings Ctrl+S

source: Save Window Snapshot
af: Stoor Skerm Beeld

source: Save Numbered Snapshot Ctrl+N
af: Stoor Genommerde Skerm Beeld Ctrl+N

source: &Status Bar
af: &Status Griffel

source: &View
af: &Vertoon

source: Fly Slower (S)
af: Vlieg stadiger (S)

source: Fly Faster (F)
af: Vlieg Vinniger (F)

source: Maintain height above ground (A)
af: Konstante hoogte bo grond (A)

source: &Navigate
af: &Navigeer

source: Normal Terrain Flyer
af: Normale Terrein Vlieenier

source: Flyer with Velocity
af: Vlieenier met Snelheid

source: Grab-Pivot
af: Gryp-Draai

source: Panoramic Flyer
af: Panoramiese Vlieenier

source: Navigation Style
af: Navigasie styl

source: LOD Terrain Surface F3
af: LOD Terrein Oppervlak F3

source: Cull every frame Ctrl+C
af: Cull elke raam Ctrl+C

source: Cull once Ctrl+K
af: Cull een keer Ctrl+K

source: Show Sky F4
af: Wys Lug F4

source: Show Ocean F5
af: Wys Oseaan F5

source: Show Plants F6
af: Wys Plante F6

source: Show Structures F7
af: Wys Strukture F7

source: Show Roads F8
af: Wys Paaie F8

source: Show Fog F9
af: Wys Mis F9

source: Increase Detail (+)
af: Meer Detail (+)

source: Decrease Detail (-)
af: Minder Detail (-)

source: Save Vegetation As...
af: Stoor Vegetasie As...

source: Save Built Structures As...
af: Stoor Geboude Strukture As...

source: Toggle Artificial Foundations
af: Verwissel Kunsmatige Fondasies

source: &Recalculate Shading Ctrl+R
af: &Herbedink Skadu Ctrl+R

source: Te&rrain
af: Te&rein

source: &Flatten Ctrl+E
af: &Maak platter Ctrl+E

source: &Unfold Ctrl+U
af: &Ontvou Ctrl+U

source: &Load Point Data... Ctrl+P
af: &Laai Punt Data Ctrl+P

source: &Earth
af: &Aarde

source: About
af: Omtrend

source: Create Fences
af: Skep Heinings

source: Create Routes
af: Skep Roetes

source: Create Plants
af: Skep Plante

source: Create Instances
af: Skep Instansies

source: Measure Distance
af: Meet Afstand

source: Maintain Height
af: Handhaaf Hoogte

source: Fly Faster
af: Vlieg Vinniger

source: Fly Slower
af: Vlieg Stadiger

source: Camera Dialog
af: Kamera Dialoog

source: Snapshot
af: Skermbeeld

source: Numbered Snapshot
af: Genommerde Skermbeeld

source: Show Layer Dialog
af: Vertoon Vlak Dialoog

source: Go to Terrain
af: Gaan na Terrein

source: Show Sunlight
af: Wys Sonlig

source: Axes
af: Asse

source: Tilt
af: Kantel

source: Add Point Data
af: Voeg Punt Data by

source: Unfold
af: Ontvou

source: Save View Snapshot
af: Stoor Uitkyk Skermbeeld

source: Load Point Data
af: Laai Punt Data

source: Couldn't Open
af: Kannie oopmaak

source: That file isn't point data.
af: Daardie leer is nie punt data nie.

source: Properties
af: Eienskappe

source: Flip Footprint Direction
af: Flip Voetspoor Rigting

source: Reload from Disk
af: Laai vanaf skyf

source: Delete
af: Wis

source: Save Vegetation Data
af: Stoor Plant Data

source: Save Built Structures Data
af: Stoor Geboude Struktuur Data

source: Meters/sec
af: Meter/sek

source: Km/hour
af: Km/h

source: Miles/hour
af: Myl/uur

source: Horizontal FOV (degrees)
af: Horisontale Sigsveld (grade)

source: Building
af: Gebou

source: Fence
af: Heining

source: Buildings: %d
af: Geboue: %d

source: Fences: %d
af: Heinings: %d

source: Instances: %d
af: Instansies: %d

source: Couldn't recall point, probably a coordinate system transformation problem.
af: Kon nie die punt herroep nie, waarskynlik 'n koordinaat probleem.

source: Load Locations
af: Laai Plekke

source: Save Locations
af: Stoor Plekke

source: Location %d
af: Plek %d

source: Type a name for the new location:
af: Gee 'n naam vir die nuwe plek:

source: Location Name
af: Plek naam

source: Couldn't store point, probably a coordinate system transformation problem.
af: Die punt kon nie gestoor word nie. Dit is waarskynlik as gevolg van 'n transformasie probleem.

source: Engines
af: Meganismes

source: Light
af: Lig

source: Geometry
af: Geometrie

source: Group
af: Groepeer

source: Other
af: Ander

source: Text Mesh
af: Skrif Net

source: (%d children)
af: (%d kinders)

source: (internal node)
af: (interne node)

source: (non-node)
af: (nie-node)

source: (%d targets total)
af: (%d teikens)

source: Maximum Texture Dimension: %d
af: Maksimum Tekstuur Dimensie: %d

source: Terrain Manager
af: Terrein Bestuurder

source: (default)
af: (standaard)

source: Terrain Flyer with Velocity
af: Terrein Vlieenier

source: (double-click to add files)
af: (dubbel-kliek om leers by te voeg)

source: One of the following to add:
af: Voeg een van die volgende by:

source: Choose a structure file
af: Kies 'n struktuur leer

source: Set Initial Time
af: Stel die Begin tyd

source: Terrain Data Paths
af: Terrein Data Paaie

source: Please enter the name for the terrain copy.
af: Voorsien asb 'n naam vir die terrein kopie

source: Add Copy of Terrain
af: Voeg 'n Terrein Kopie by

source: Please enter the name for a new terrain .xml file.
af: Vul asb 'n naam in vir 'n nuwe terrein .xml leer.

source: Add Terrain
af: Voeg Terrein By

source: Specify Data Directory
af: Spesifiseer Data Gids

source: Remove
af: Verwyder

source: Cancel
af: Kanselleer

source: Launch with:
af: Lanseer met:

source: Earth View
af: Aard aansig

source: Image:
af: Beeld:

source: Terrain
af: Terrein

source: Edit Properties
af: Verstel Eienskappe

source: Enabled
af: Aktief

source: Zoom To
af: Zoom Na

source: Refresh
af: Verfris

source: Name:
af: Naam:

source: Elevation
af: Hoogte

source: Texture
af: Tekstuur

source: Culture
af: Kultuur

source: Sky && Ocean
af: Lug && Oseaan

source: Miscellaneous
af: Bykomend

source: Species:
af: Spesie:

source: Height:
af: Hoogte:

source: meters
af: meter

source: Planting Options
af: Plant opsies

source: Individual instances
af: Individueele instansies

source: Straight line
af: Reguit lyn

source: Continuously
af: Kontinue

source: Height variance:
af: Hoogte variasie:

source: Minimum spacing:
af: Minimum spasieering

source: Save
af: Stoor

source: Load
af: Laai

source: Recall ->
af: Herroep ->

source: <- Store
af: <- Stoor

source: Store As..
af: Stoor as...

source: Speed:
af: Spoed:

source: Near Clipping Plane (meters):
af: Naby Stopvlak (meter):

source: Far Clipping Plane (meters):
af: Ver Stopvlak (meter)

source: Navigation Speed:
af: Navigasie Spoed:

source: Units
af: Eenhede

source: Accelerate by height above ground
af: Versnel teen hoogte bo grond

source: LOD distance for Vegetation
af: LOD afstand vir Vegetasie

source: LOD distance for Structures
af: LOD afstand vir Strukture

source: LOD distance for Roads
af: LOD afstand vir Paaie

source: Structure Type:
af: Struktuur Tipe:

source: Elevation Grid
af: Hoogte Net

source: Grid Filename:
af: Net Leernaam:

source: Terrain LOD Method:
af: Terrein LOD Metode:

source: Triangle Count:
af: Driehoek Telling:

source: Pixel Error Bound:
af: Spikkel Foutgrens:

source: Use strips/fans
af: Gebruik strepe/waaiers

source: Elevation TIN
af: Hoogte TIN

source: TIN Filename:
af: TIN Leernaam:

source: Vertical Exaggeration:
af: Vertikale Skaal:

source: No texture
af: Geen tekstuur

source: Single texture
af: Enkele tekstuur

source: Derive texture from elevation
af: Basseer tekstuur op elevasie

source: 4x4 Tiled texture
af: 4x4 Teel tekstuur

source: Tile size:
af: Teel grootte

source: Filename base:
af: Leernaam basis:

source: File Format:
af: Leer Formaat:

source: Filename:
af: Leernaam:

source: Mipmapping
af: Mipkartering

source: Request 16-bit
af: Versoek 16-bis

source: Precompute lighting
af: Preverwerk beligting

source: Lighting factor:
af: Beligtings faktor:

source: Cast shadows
af: Gooi skadus

source: Source file:
af: Bron leer:

source: Visibility distance:
af: Sigsafstand:

source: Roads
af: Paaie

source: Ground offset:
af: Grond afset:

source: Visibility distance:
af: Sigbaarheids afstand:

source: Texture-map roads
af: Tekstuur-kaart paaie

source: Road culture (stoplights, etc.)
af: Pad kultuur (stopligte ens)

source: Include:
af: Ingesluit:

source: Highways
af: Hoofwee

source: Paved
af: Geteer

source: Dirt
af: Grondpad

source: Structure Files
af: Struktuur Leers

source: Enable Vehicles
af: Aktiveer Voertuie

source: Navigation
af: Navigasie

source: Style:
af: Styl:

source: Minimum height above ground:
af: Minimum hoogte bo die grond:

source: Navigation speed:
af: Navigasie spoed:

source: meters/frame
af: meter/raam

source: Default Locations File:
af: Standaard Plek Leer:

source: Initial Camera Location
af: Begin Kamera Posisie

source: Near clipping ("Hither") distance
af: Naby stopvlak afstand

source: Initial Time:
af: Begin tyd:

source: Set
af: Stel

source: Time Moves
af: Tyd Skuif

source: Faster than real:
af: Vinniger as Werklik:

source: Add Path
af: Voeg Pad by

source: Add Copy
af: Voeg Kopie By

source: Edit Parameters
af: Stel Parameters

source: Ocean plane
af: Oseaan vlak

source: Level (meters)
af: Vlak (meter)

source: Depress Ocean
af: Hol Oseaan uit

source: Sky dome
af: Lug koepel

source: Artificial Horizon
af: Kunsmatige Horison

source: Fog
af: Vog

source: Distance (km)
af: Afstand (km)

source: Visible
af: Sigbaar

source: Show All
af: Wys Alles

source: Year:
af: Jaar:

source: Month
af: Maand

source: Day
af: Dag

source: Hour:
af: Uur

source: Minute
af: Minuut

source: Second
af: Sekonde

source: Color:
af: Kleur:

source: Height above ground
af: Hoogte bo grond:

source: Label Size (vertical)
af: Naamplaat grootte (vertikaal)

source: Building Levels
af: Gebou Vlakke

source: Copy
af: Kopieer

source: Del
af: Wis

source: Up
af: Op

source: Down
af: Af

source: Baseline Editor
af: Basisvlak Redigeerder

source: Level Properties
af: Vlak Eienskappe

source: Stories:
af: Verdiepings:

source: Story Height:
af: Verdieping hoogte:

source: Material:
af: Materiaal:

source: Edge Slopes:
af: Rand Heuwels:

source: Edges >>
af: Rand >>

source: Edges:
af: Rand:

source: Edge Properties
af: Rand Eienskappe

source: Facade
af: Fasade

source: Slope:
af: Heuwel:

source: Clear
af: Skoon

source: Wall
af: Muur

source: Window
af: Venster

source: Door
af: Deur

source: Edges <<
af: Rand <<

source: Type:
af: Tipe:

source: Spacing:
af: Spasiering:

source: Height:
af: Hoogte:

source: Instance from Content File
af: Instansie vanaf Inhoud Leer

source: File:
af: Leer:

source: Instance from 3D Model File
af: Instansie vanaf 3D Model Leer

source: Location:
af: Plek:

source: Map Offset
af: Kaart Afset

source: Map Distance
af: Kaart Afstand

source: Geodesic Distance
af: Geodiese Afstand

source: Approximate Ground
af: Geskatte Grond

source: Vertical Difference
af: Vertikale Verskil
